Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: མུན་ཁྲོད་ནས་མུན་ཁྲོད་དུ་མཆི་བའི་སེམས་ཅན་དེ་དག་ནི་དེའི་ཚེ་ན་ལས་ཀྱི་རྐྱེན་རབ་ཏུ་དམ་པོས་བསྐལ་པ་བཟང་པོ་ལ་ལོ་བརྒྱ་ཉི་ཤུ་པ་རྣམས་སུ་སྐྱེ་བར་འགྱུར་ལགས་སོ།
en: Comfortable with bad actions, they will go from darkness to darkness. At that time in the Bhadraka eon, because of excessive karma, those beings will be born to live for 120 years.

source: །སེམས་ཅན་དེ་དག་གི་ལས་ཀྱི་རྐྱེན་གྱིས་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ཀྱང་དགེ་བའི་རྩ་བ་བསྐྱེད་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་སྤངས་ཤིང་དམན་པར་འགྱུར་ཏེ།
en: Because of the karma of those beings, the Sahā buddha realm will be inferior. It will be devoid of any beings who have planted good roots.

source: ས་གཞི་བ་ཚྭ་ཅན་དུ་འགྱུར། ས་གཞི་གོར་མ་དང་། གསེག་མ་དང་། རྡུལ་དང་། རི་རད་རོད་ཅན་དུ་འགྱུར།
en: The earth will be saline, and the ground will have rocks, gravel, and dust and be uneven with mountains.

source: ཤ་སྦྲང་དང་། སྦྲང་བུ་མཆུ་རིངས་དང་། སྦྲུལ་དང་། གཅན་གཟན་ཁྲོ་བོ་དང་། བྱ་གདུག་པ་དག་གིས་ཀུན་ཏུ་བལྟམ་པར་འགྱུར།
en: It will be filled with nasty flies, mosquitoes, venomous snakes, and vicious animals and birds.

source: དུས་མ་ལགས་པར་རྡུལ་གྱིས་འཁྲིགས་པའི་བསེར་མ་ལྡང་བར་འགྱུར།
en: There will be untimely dust storms.

source: དུས་མ་ལགས་པར་རོ་མ་མཆིས་པ་དང་། ལན་ཚྭ་དང་འདྲེས་པ་དང་། མི་བསིལ་བའི་ཆར་བ་འབབ་པར་འགྱུར་ཞིང་། དེ་ལྟར་ས་ལ་ལོ་ཐོག་དང་། སྨན་དང་། རྩྭ་དང་། ཤིང་ལྗོན་པ་དང་། ལོ་མ་དང་།
en: There will be untimely fierce rains mixed with distasteful salt. “ ‘

source: མེ་ཏོག་དང་། འབྲས་བུ་དང་། འབྲུ་དང་། ནོར་རྣམས་དང་། སེམས་ཅན་རྣམས་ཀྱི་བཟའ་བ་དང་། བཏུང་བ་དང་། ལོངས་སྤྱོད་དང་། ཉེ་བར་སྤྱོད་པ་རྣམས་ཀྱང་ངན་པ་དང་། རྙོག་པ་ཅན་དང་། རུད་རུད་པོ་དང་། རྩུབ་པ་དང་། དུག་དང་འདྲེས་པར་འགྱུར་ཏེ། སེམས་ཅན་དེ་དག་གིས་འཚལ་ནས་ཀྱང་སླར་ཞིང་རྒྱ་ཆེར་རྩུབ་པ་དང་། གདུག་པ་དང་། ཁྲོ་བ་དང་། གཏུམ་པ་དང་། བརླང་བ་དང་།
en: In this way, the ground will yield crops, herbs, grass, trees, leaves, flowers, fruit, grain, and juices that are bad food and drink for beings to enjoy and subsist on, being foul, harsh, rough, and poisonous.

source: འཇུངས་པ་དང་། གཤེ་བ་དང་། གཅིག་ལ་གཅིག་མི་གུས་པ་དང་། འཇིགས་པའི་སེམས་ཀྱིས་ཀུན་ནས་མནར་སེམས་ཀྱི་སེམས་དང་། གསོད་པའི་སེམས་དང་ལྡན་པར་འགྱུར་ཞིང་ཤ་འཚལ་བ་དང་།
en: Consuming them, those beings will become even rougher and more malevolent, angry, ferocious, harsh, avaricious, abusive, disrespectful to each other, and, afflicted by terror, they will have a greater wish to slaughter and to kill.

source: ཁྲག་འཚལ་བ་དང་། རི་དགས་ཀྱི་པགས་པ་འཚལ་བ་དང་། མཚོན་ཆ་ཐོགས་པ་དང་། སྲོག་ཆགས་འགུམས་པ་ལ་བརྩོན་པ་དང་། བྱད་གཟུགས་དང་། རིགས་དང་། རྒྱུད་དང་། དབང་ཕྱུག་དང་། བསྟན་བཅོས་དང་།
en: They will eat meat, consume blood, wear the skin of animals, carry weapons, and slaughter animals.

source: ཡི་གེ་དང་། རྟ་རྩལ་དང་། མདའ་གཞུ་དང་། མཚོན་ཆ་ཐོགས་པ་དང་། འཁོར་དང་།
en: They will be proud and envious of appearance, family, lineage, power, learning, writing, horse riding, archery, weapons, and retinues.

source: སྲེར་སྣ་དང་། དྲེགས་ངས་པར་འགྱུར་ཏེ། འཇིག་རྟེན་གྱི་དཀའ་ཐུབ་དང་། བརྟུལ་ཞུགས་ངན་པ་རྣམ་པ་སྣ་ཚོགས་ལ་མངོན་པར་བརྩོན་པར་གྱུར་པ་དེའི་ཚེ་ན།
en: People will apply themselves to various kinds of spurious asceticism and vows. “ ‘

source: བདག་འདུལ་བའི་སེམས་ཅན་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་སྨིན་པར་བགྱི་བའི་སླད་དུ། དགའ་ལྡན་གྱི་གནས་ནས་བབས་ཏེ་འཁོར་ལོས་སྒྱུར་བའི་རིགས་རྒྱུད་ཁྱད་པར་དུ་འཕགས་པའི་དབང་ཕྱུག་རྒྱལ་པོའི་རིགས་སུ་བཙུན་མོ་དམ་པའི་ཁོང་དུ་མངལ་ན་གནས་པ་ཉེ་བར་འཛིན་པར་གྱུར་ཅིག །
en: At that time, so as to ripen good roots in beings who can be trained, may I descend from the abode of Tuṣita and acquire the womb of a queen in an eminent, powerful, royal family of a cakravartin family lineage. “ ‘

source: དེའི་ཚེ་བདག་གིས་ཐམས་ཅད་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་སྣང་བ་རྒྱ་ཆེན་པོས་ཁྱབ་པར་བགྱིད་པར་འགྱུར་ཞིང་།
en: At that time, may I shine a wonderful light throughout the entire Sahā buddha realm.

source: སྟེང་དུ་ནི་འོག་མིན་གྱི་གནས་ཀྱི་བར་གྱི་མཐར་ཐུག་པའི་བར་དང་། འོག་ཏུ་ནི་གསེར་གྱི་འཁོར་ལོའི་མཐར་ཐུག་པའི་བར་དག་ཀྱང་སྣང་བ་རྒྱ་ཆེན་པོས་ཁྱབ་པར་བགྱིད་པར་གྱུར་ཅིག །
en: May that wonderful light shine as far above as the Akaniṣṭha paradise and as far below as the golden disk.

source: དེའི་ཚེ་ན་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ན་སེམས་ཅན་གང་དག་སེམས་ཅན་དམྱལ་བ་རྣམས་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དང་། ལྷ་དང་མི་རྣམས་སུ་སྐྱེས་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་སྣང་བ་དེ་མཐོང་ཞིང་རེག་པ་དང་། ཀུན་ཏུ་འཚལ་བར་གྱུར་ཅིག །
en: At that time, may all beings in the Sahā buddha realm—whether born in the hells, in an animal birth, in Yama’s world, or as devas or humans—all see, touch, and know that light.

source: འཁོར་བ་ལ་རྟོག་ཅིང་སྡུག་བསྔལ་གྱིས་ཡིད་བྱུང་བ་དེ་དག་ཀྱང་མྱ་ངན་ལས་འདས་པར་འཚལ་ཞིང་ཐ་ན་ཉོན་མོངས་པ་ཞི་བར་བགྱི་བ་དེའི་སེམས་སྐྱེད་པར་ཡང་གྱུར་ཅིག །
en: May they contemplate saṃsāra, become frightened of suffering, and long for nirvāṇa to the extent that they develop the aspiration to bring their kleśas to an end.

source: དང་པོར་ལམ་མཆོག་གི་ས་བོན་འདི་ཡང་སྐྱེད་པར་གྱུར་ཅིག །
en: May I cause them to plant this first seed of the supreme path. “ ‘

source: གང་གི་ཚེ་བདག་ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་ལ་མཁས་པའི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་སྟོན་པའི་ཆོས་ཀྱི་སྒོ་གཅིག་གིས་བསྐལ་པ་ཕྱི་མའི་མཐར་སྟོན་ཅིང་སེམས་མཉམ་པར་བཞག་ནས་ཟླ་བ་བཅུར་མའི་མངལ་ན་གནས་པར་གྱུར་ཅིག །
en: May I reside in my mother’s womb for ten months having settled my mind in meditation and teaching at the end of the eon by means of the single entrance to the Dharma that shows all samādhis to be proficient in the way of all dharmas.

source: བདག་གིས་སངས་རྒྱས་ཉིད་ཐོབ་ནས་ཡོངས་སུ་སྐྱོ་བའི་སེམས་ཅན་གང་དག་འཁོར་བ་ལས་ཡོངས་སུ་ཐར་བར་བགྱིད་པར་འགྱུར་བའི་སེམས་དེ་དག་གིས།
en: When I have attained buddhahood, may I liberate beings who are weary of saṃsāra.

source: བདག་ཟླ་བ་བཅུར་མའི་མངལ་ན་ནོར་བུའི་སྙིང་པོ་ཡང་དག་པར་སྟོན་པ་ལ་སེམས་མཉམ་པར་བཞག་ནས་སྐྱིལ་མོ་ཀྲུང་གིས་མཆིས་པ་མཐོང་བར་གྱུར་ཅིག །
en: During my ten months in the womb, may those beings see me sitting cross-legged, with my mind resting in the samādhi of showing the jewel essence. “ ‘

source: ཟླ་བ་བཅུ་པོ་འདས་ནས་བདག་གིས་བསོད་ནམས་ཐམས་ཅད་ཡང་དག་པར་བསྩགས་པའི་ཏིང་ངེ་འཛིན་གྱིས་ཐམས་ཅད་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ཀྱི་ས་རྣམ་པ་དྲུག་ཏུ་གཡོ་བར་བགྱིད་པར་འགྱུར་ཞིང་།
en: When ten months have passed, through the samādhi of having the accumulation of all merit, may the entire Sahā buddha realm shake in six ways.

source: སྟེང་དུ་ནི་འོག་མིན་གྱི་གནས་ཀྱི་མཐར་ཐུག་པའི་བར་དང་། འོག་ཏུ་ནི་གསེར་གྱི་འཁོར་ལོའི་མཐར་ཐུག་པའི་བར་དག་ཀྱང་རྣམ་པ་དྲུག་ཏུ་གཡོ་བར་བགྱིད་པར་གྱུར་ཅིག །
en: May it shake in six ways as far above as the Akaniṣṭha paradise and as far below as the golden disk.

source: དེའི་ཚེ་ན་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དུ་སེམས་ཅན་གང་དག་སེམས་ཅན་དམྱལ་བ་རྣམས་དང་མི་རྣམས་སུ་སྐྱེས་པར་གྱུར་པ་དེ་དག་ཀྱང་རབ་ཏུ་སད་པར་བགྱིད་པར་གྱུར་ཅིག། །།བམ་པོ་བཅུ་པ།
en: At that time, may I wake up the beings in the Sahā buddha realm, from those born in the hells up to those born as humans. “ ‘

source: བདག་མའི་མཆན་ཁུང་གཡས་པ་ནས་མངོན་པར་འབྱུང་བའི་ཚེ་ཡང་ཐམས་ཅད་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་སྣང་བ་རྒྱ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཅིག །
en: When I emerge from the right side of my mother’s belly, may I furthermore shine a wonderful light throughout the entire Sahā buddha realm.

source: དེའི་ཚེ་དེའི་དུས་ན་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ཐམས་ཅད་ཀྱི་སེམས་ཅན་རྣམས་ལ་ཡང་ཡང་དག་པར་སྐུལ་བར་གྱུར་ཅིག །
en: At that time may I inspire beings throughout the Sahā buddha realm.

source: དགེ་བའི་རྩ་བ་མ་བསྐྲུན་པའི་སེམས་ཅན་རྣམས་ཀྱི་རྒྱུད་ལ་མྱ་ངན་ལས་འདས་པའི་ས་བོན་འདེབས་པར་གྱུར་ཅིག །
en: May I plant the seed of nirvāṇa within the minds of beings who have not yet planted any good roots.

source: མྱ་ངན་ལས་འདས་པའི་ས་བོན་བསྐྱེད་པའི་སེམས་ཅན་རྣམས་ཀྱི་རྒྱུད་ལ་ཏིང་ངེ་འཛིན་གྱི་མྱུ་གུ་སྐྱེད་པར་གྱུར་ཅིག །
en: May I cause the seedling of samādhi to grow for those beings in whose minds the seed of nirvāṇa has been planted. “ ‘

source: གང་གི་ཚེ་བདག་གི་རྐང་པའི་མཐིལ་གྱིས་ས་ལ་རེག་པར་འགྱུར་བ་དེའི་ཚེ་ན་ཐམས་ཅད་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ཀྱི་ས་གཞི་གསེར་གྱི་འཁོར་ལོའི་མཐར་ཐུག་པའི་བར་དག་རྣམ་པ་དྲུག་ཏུ་གཡོས་པ་དང་། རབ་ཏུ་འགུལ་བ་དང་། འཁྲུག་པར་གྱུར་ཅིག །
en: When I touch the ground with the soles of my feet, at that time may the entire ground in the Sahā buddha realm quiver, quake, and shake in six ways, as far down as the golden disk. “ ‘

source: དེའི་ཚེ་ན་བདག་གིས་གང་དག་སྐྱེ་གནས་བཞིར་གཏོགས་ཤིང་འགྲོ་བ་ལྔ་ལ་རྟེན་པའི་སེམས་ཅན་ཆུ་ལ་རྟེན་པ་རྣམས་དང་། ས་ལ་རྟེན་པ་རྣམས་དང་། ནམ་མཁའ་ལ་རྟེན་པ་དེ་དག་ཐམས་ཅད་རབ་ཏུ་སད་པར་བགྱིད་པར་གྱུར་ཅིག །
en: Then, at that time, may I wake up all the beings of the four kinds of birth, the beings in the five kinds of existences, those that live in water, those that live on the ground, and those that live in the air. “ ‘

source: སེམས་ཅན་གང་དག་གི་རྒྱུད་ལ་ཏིང་ངེ་འཛིན་གྱི་མྱུ་གུ་མ་སྐྱེས་པ་རྣམས་ཀྱང་སྐྱེད་པར་གྱུར་ཅིག །
en: May I cause the seedling of samādhi to grow in the minds of beings in whom it has not yet arisen.

source: ཏིང་ངེ་འཛིན་གྱི་མྱུ་གུ་བརྟན་པར་གྱུར་པ་རྣམས་ནི་ཐེག་པ་གསུམ་པོ་དག་གིས་ཕྱིར་མི་ལྡོག་པ་ལ་འགོད་པར་གྱུར་ཅིག །བདག་བཙས་མ་ཐག་ཏུ་དེའི་མོད་ལ་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དེའི་ཚངས་པ་ཆེན་པོ་རྣམས་དང་། བདུད་རྣམས་དང་། བརྒྱ་བྱིན་རྣམས་དང་། ཟླ་བ་རྣམས་དང་། ཉི་མ་རྣམས་དང་། འཇིག་རྟེན་སྐྱོང་བ་རྣམས་དང་། ཀླུའི་རྒྱལ་པོ་ཆེན་པོ་རྣམས་དང་། ལྷ་མ་ཡིན་གྱི་དབང་པོ་རྣམས་དང་།
en: May I establish as irreversible, by means of the three yānas, those in whom the seedling of samādhi is stable.

source: རྫུས་ཏེ་སྐྱེས་པ་རྣམས་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ཀླུ་དང་། ལྷ་མ་ཡིན་རྫུ་འཕྲུལ་ཆེན་པོ་ཐམས་ཅད་ཀྱང་བདག་ལ་མཆོད་པ་བགྱི་བའི་སླད་དུ་ཉེ་བར་མཆིས་པར་གྱུར་ཅིག །
en: As soon as I am born, may all the great brahmās, māras, śakras, candras, sūryas, world protectors, great nāga kings, asura lords, those born miraculously, those with miraculous powers, yakṣas, rākṣasas, nāgas, and asuras in that Sahā buddha realm come to me in order to make offerings.

source: བདག་བཙས་མ་ཐག་ཏུ་གོམ་པ་བདུན་འདོར་བར་གྱུར་ཅིག །
en: As soon as I am born, may I take seven steps.

source: བདག་གིས་བསོད་ནམས་ཐམས་ཅད་ཡང་དག་པར་བསྩགས་པའི་ཏིང་ངེ་འཛིན་གྱིས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་གང་ལགས་པ་དེ་ཐེག་པ་གསུམ་པོ་དག་གིས་རབ་ཏུ་དང་བ་ཐོབ་པར་འགྱུར་བ་དེ་ལྟར་ཆོས་སྟོན་པར་གྱུར་ཅིག །
en: Through the samādhi of having the accumulation of all merit, may I teach the Dharma in such a way that all my disciples gain appreciation of the three yānas. “ ‘

source: འཁོར་དེ་ན་ཉན་ཐོས་ཀྱི་ཐེག་པ་བའི་སེམས་ཅན་སྲིད་པ་ཐ་མ་པར་གྱུར་པ་གང་ལགས་པ་དེ་དག་བདག་གིས་འདུལ་བར་གྱུར་ཅིག །
en: May I guide those beings among my followers who are in the Śrāvakayāna and in their last existence.

source: དེ་ན་གང་དག་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་བར་གྱུར་པའི་སེམས་ཅན་དེ་དག་གིས་རྣམ་པར་སྣང་བྱེད་མེ་ཏོག་གི་བཟོད་པ་ཐོབ་པར་གྱུར་ཅིག །
en: May those beings there who are in the Pratyekabuddhayāna attain the acceptance called flowers of the sun.

source: དེ་ནས་གང་དག་བླ་ན་མེད་པའི་ཐེག་པ་ཆེན་པོ་པར་གྱུར་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱིས་རྡོ་རྗེའི་ཏིང་ངེ་འཛིན་རྒྱ་མཚོ་འཁྲུགས་ཀྱི་ཏིང་ངེ་འཛིན་ཐོབ་པར་གྱུར་ཅིག །ཏིང་ངེ་འཛིན་དེས་ས་གསུམ་པོ་དག་ལས་ཡང་དག་པར་འདས་པར་གྱུར་ཅིག །
en: May all those beings there who are in the highest Mahāyāna attain the samādhi of the wild ocean of vajra holders, and through that samādhi may they pass beyond the three bhūmis. “ ‘

source: གང་གི་ཚེ་བདག་ཁྲུས་བགྱིད་པར་འཚལ་བ་ན་དེ་ན་ཀླུའི་རྒྱལ་པོ་ཆེན་པོ་ཁྱད་པར་དུ་འཕགས་པ་གང་དག་མཆིས་པར་གྱུར་པ་དེ་དག་བདག་ལ་ཁྲུས་བགྱིད་པར་གྱུར་ཅིག །
en: When I wish to be washed, may the most distinguished great nāga kings that are there wash me.

source: སེམས་ཅན་གང་དག་གིས་བདག་འཁྲུ་བར་མཐོང་བར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཐེག་པ་གསུམ་པོ་དག་གིས་ཇི་སྐད་སྨོས་པའི་ཡོན་ཏན་དེ་ལྟ་བུ་དག་མངོན་པར་རྟོགས་པར་གྱུར་ཅིག །སེམས་ཅན་གང་དག་གིས་བདག་ཤིང་རྟ་ལ་འཚལ་བ་མཐོང་བར་གྱུར་པ་དང་། རྒྱ་ཆེར་བགྱིད་ན་སེམས་ཅན་གང་དག་གིས་བདག་གཞོན་ནུ་རྩེ་བ་དག་དང་། བཟོའི་གནས་དང་། ལས་ཀྱི་གནས་དང་། སྐད་སྣ་ཚོགས་སྟོན་པ་དག་དང་། བསླབ་ཏུ་རུང་བ་དང་།
en: And may all the beings who see me being washed realize such qualities by way of the three yānas as previously described. “ ‘

source: བུད་མེད་རྣམས་ཀྱི་གནས་སུ་འདོད་པའི་ཡོན་ཏན་ལྔའི་དགའ་བ་དང་། རྩེད་མོས་ཡིད་བྱུང་ནས་དགུང་ཕྱེད་ན་མངོན་པར་བྱུང་སྟེ། རྒྱན་དང་ལྷབ་ལྷུབ་སྤངས་ནས་ཡང་དང་ཡང་དུ་གོས་དམར་པོ་དང་། ཆོས་གོས་ངུར་སྨྲིག་ཡོངས་སུ་ཚོལ་བ་དང་། བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་དུ་ཉེ་བར་བགྲོད་པའི་སླད་དུ་མཆི་བ་མཐོང་བར་གྱུར་པའི་སེམས་ཅན་དེ་དག་ལ་ཡང་བདག་གིས་བསོད་ནམས་ཐམས་ཅད་ཡང་དག་པར་བསྩགས་པའི་ཏིང་ངེ་འཛིན་གྱིས།
en: May I, through the samādhi of the accumulation of all merit, teach the Dharma to those beings in such a way that they see me ascending into a chariot, and—to go into detail—see my youthful games, various skills, works, and my capability in studies; enjoying the five sensory pleasures in the women’s apartments; becoming disquieted; departing at midnight; abandoning jewelry and adornments; constantly searching for red and orange clothes; seeking orange clothes; and going toward the Bodhi tree.

source: ཅི་ནས་ཀྱང་ཐེག་པ་གསུམ་པོ་དག་གིས་སེམས་ཅན་དེ་དག་འདུན་པ་དྲག་ཅིང་བརྩོན་པར་གྱུར་པ་དེ་ལྟར་ཆོས་སྟོན་པར་གྱུར་ཅིག །
en: And may they thereby develop a strong attraction to the three yānas.

source: དེ་ན་གང་དག་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་བར་གྱུར་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱིས་རྣམ་པར་སྣང་བྱེད་མེ་ཏོག་གི་ཏིང་ངེ་འཛིན་ཐོབ་པར་གྱུར་ཅིག །
en: May the beings there who are of the Pratyekabuddhayāna all attain the acceptance called flowers of the sun.

source: གང་དག་གིས་ཐེག་པ་ཆེན་པོའི་ས་བོན་བཏབ་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་རྡོ་རྗེའི་ཏིང་ངེ་འཛིན་རྒྱ་མཚོ་འཁྲུགས་ཀྱི་ཏིང་ངེ་འཛིན་ཐོབ་པར་གྱུར་ཅིག །ཏིང་ངེ་འཛིན་དེས་ས་གསུམ་པོ་དག་ལས་ཡང་དག་པར་འདས་པར་གྱུར་ཅིག །
en: May those in whom the seed of the Mahāyāna has been planted all attain the samādhi of the wild ocean of vajra holders and pass beyond the three bhūmis through that samādhi. “ ‘

source: བདག་ཉིད་ཀྱིས་སྟན་བཏིང་བ་བསྡུས་ཏེ་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་དུ་རྡོ་རྗེའི་གདན་བཤམས་པ་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ནས་ལུས་དྲང་པོར་བསྲང་སྟེ། མཆིས་ནས་བདག་དབུགས་འབྱུང་བ་དང་། དབུགས་རྔུབ་པ་ཉེ་བར་ཞི་བ་དེ་ལྟ་བུའི་མཁའ་ཁྱབ་ཀྱི་བསམ་གཏན་སྒོམ་པར་གྱུར་ཅིག །
en: May I gather together grass and arrange a seat on the vajra throne at the root of the Bodhi tree, and sit down upon it cross-legged, holding my body upright, and with my exhalation and inhalation stilling, may I meditate on the dhyāna that pervades space.

source: བདག་གདུགས་ལ་ལན་ཅིག་བསམ་གཏན་ལས་ལྡང་བར་གྱུར་ཅིག །ལངས་ནས་ཀྱང་ཟས་སུ་ཏིལ་གྱི་འབྲས་བུ་ཕྱེད་ཅིག་འཚལ་བར་གྱུར་ཅིག །ཕྱེད་ནི་སློངས་མོ་པ་ལ་སྩོལ་བར་གྱུར་ཅིག །
en: May I emerge from that dhyāna once each day, and, having risen from it, may I eat half a sesame seed and give the other half to a beggar. “ ‘

source: གང་དག་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དུ་གཏོགས་པའི་འོག་མིན་གྱི་གནས་ཀྱི་མཐར་ཐུག་པའི་བར་གྱི་ལྷ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བདག་ལ་མཆོད་པ་བགྱི་བའི་སླད་དུ་ཉེ་བར་མཆི་བར་འགྱུར་ཞིང་།
en: While I am undergoing such hardship for a long time, may all the devas in the Sahā buddha realm, from as far above as the Akaniṣṭha paradise, come there and make offerings to me.

source: དེ་དག་ཐམས་ཅད་ཀྱང་བདག་དཀའ་བ་སྤྱོད་པའི་དབང་དུ་འགྱུར་བ་དེ་སྲིད་དུ་ཡུན་རིང་པོར་བདག་དེ་ལྟ་བུའི་དཀའ་བ་སྤྱད་པ་སྤྱོད་པར་གྱུར་ཅིག །
en: May they all be witnesses to my hardship.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་ན་གང་དག་གིས་ཉན་ཐོས་ཀྱི་ཐེག་པ་བར་ས་བོན་བཏབ་པར་གྱུར་པ་དེ་དག་གི་རྒྱུད་ལ་ཉོན་མོངས་པ་རབ་ཏུ་ཞི་བར་བགྱིད་པར་གྱུར་ཅིག །ཇི་ལྟར་སྔར་སྨོས་པ་བཞིན་དུ་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་གང་ལགས་པ་དག་ཀྱང་བདག་གིས་འདུལ་བའི་སྲིད་པ་ཐ་མར་གྱུར་ཅིག །དེ་བཞིན་དུ་ཀླུ་དང་། གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་།
en: Bhadanta Bhagavat, may I bring to an end the kleśas in the minds of those in whom the seed of the Śrāvakayāna has been planted, and may they become my disciples who are in their last existence; and may it also be for those in the Pratyekabuddhayāna as previously described. “ ‘

source: ལྟོ་འཕྱེ་ཆེན་པོ་དང་། ཡི་དགས་དང་། ཤ་ཟ་དང་། གྲུལ་བུམ་རྣམས་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པའི་དྲང་སྲོང་རྣམས་ཀྱང་བདག་ལ་མཆོད་པ་བགྱི་བའི་སླད་དུ་མཆི་བར་འགྱུར་ཞིང་དེ་དག་ཐམས་ཅད་བདག་དཀའ་བ་སྤྱོད་པའི་དབང་དུ་གྱུར་ཅིག །
en: In the same way, may nāgas, yakṣas, asuras, garuḍas, kinnaras, mahoragas, pretas, piśācas, kumbhāṇḍas, and ṛṣis with the five clairvoyances come to make offerings to me, and may they all be witnesses to my hardships.

source: གང་དག་ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་དག་གི་བར་དུ་ཇི་ལྟར་སྔར་སྨོས་པ་བཞིན་དུ་གྱུར་ཅིག །
en: And may it be as previously described for those in the Śrāvakayāna and so on. “ ‘

source: གླིང་བཞི་པ་དེ་ན་གཞན་མུ་སྟེགས་ཅན་བརྟུལ་ཞུགས་དང་དཀའ་ཐུབ་ངན་པའི་དཀའ་བ་སྤྱད་པ་སྤྱོད་པ་གང་ལགས་པ་དེ་དག་ལ་ཡང་མི་མ་ལགས་པ་དག་གིས་ཁྱེད་ཅག་དཀའ་བ་བྱེད་པ་མ་ཡིན་ཏེ། ཇི་ལྟར་ཕྱོགས་འདི་ན་བྱང་ཆུབ་སེམས་དཔའ་སྲིད་པ་ཐ་མ་པ་དཀའ་བ་སྤྱད་པ་སྤྱོད་པ་དང་། སྙིང་ལ་ཡིད་ལ་བྱེད་པ་འདོགས་ཤིང་ལུས་ཀྱི་འདུ་བྱེད་ཤིན་ཏུ་སྦྱངས་པ་དང་། ངག་གི་འདུ་བྱེད་ཤིན་ཏུ་སྦྱངས་པ་དང་། དེའི་དབུགས་དབྱུང་བ་དང་། དབུགས་རྔུབ་པ་དག་རབ་ཏུ་ཞི་བ་དང་།
en: May nonhumans tell the other tīrthikas who reside in the four continents practicing spurious asceticism and vows of hardship, “You are not practicing hardship like the bodhisattva in his last life who is undergoing hardship in this region; through meditating he has immobilized the mental activity in his heart, he has becalmed the activity of the body, he has stilled the activity of speech, his exhalations and inhalations have ceased, and each day when he arises from meditation he eats half a sesame seed for food.

source: ཉིན་གཅིག་བཞིན་དུ་ལན་རེ་བསམ་གཏན་ལས་ལངས་ནས། ཟས་སུ་ཏིལ་གྱི་འབྲས་བུ་ཕྱེད་ཟ་ཞིང་དེ་ལྟར་བསམ་གཏན་སྒོམ་པའི་དཀའ་བ་སྤྱད་པ་དེ་ནི་མཐུ་ཆེ་བ་ཡིན། དེ་ནི་འབྲས་བུ་ཆེ་བ་ཡིན་ཏེ། དེ་ནི་རྒྱ་ཆེ་བ་ཡིན་ཏེ།
en: That kind of hardship is very powerful, will have a great result, and is vast.

source: དེ་ནི་རིང་པོར་མི་ཐོགས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: He will soon attain the complete enlightenment of perfect buddhahood.

source: །གལ་ཏེ་ཡིད་མི་ཆེས་ན་དེང་ལ་ཉིད་ཀྱིས་ལྟོས་ཤིག་ཅེས་བསྒོ་བར་གྱུར་ཅིག །
en: If you don’t believe it, come and see for yourselves!” “ ‘

source: དེ་དག་གིས་ཀྱང་དཀའ་བ་སྤྱོད་པ་དེ་བཏང་སྟེ་བདག་དཀའ་བ་སྤྱོད་པ་མཐོང་ནས་གང་དག་གིས་སེམས་ཀྱི་རྒྱུད་ལ་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་ས་བོན་གྱི་མྱུ་གུ་གནས་པར་འགྱུར་བའི་བར་དུ་ཇི་ལྟར་སྔར་སྨོས་པ་བཞིན་དུ་གྱུར་ཅིག །མིའི་རྒྱལ་པོ་རྣམས་དང་། བཀྲབས་པ་རྣམས་དང་།
en: May they abandon their hardship and come to see my hardship, and for those in whose minds there is the seed or seedling of the Śrāvakayāna, and so on, may it be as previously described.

source: གྲོང་མི་རྣམས་དང་། ལྗོངས་ཀྱི་མི་རྣམས་དང་། ཁྱིམ་ན་གནས་པ་རྣམས་དང་། རབ་ཏུ་བྱུང་བ་རྣམས་དང་། གྲོང་ཁྱིམ་དང་བཅས་པ་གང་ལགས་པ་དེ་དག་ཀྱང་བདག་དཀའ་བ་སྤྱོད་པའི་དྲུང་དུ་མཆི་བར་འགྱུར་ཞིང་ཉན་ཐོས་ཀྱི་ཐེག་པ་བའི་བར་དུ་ཇི་ལྟར་སྔར་སྨོས་པ་བཞིན་དུ་གྱུར་ཅིག །
en: Among humans may kings, respected men, townsmen, and the people of the land, the mendicants who have left home, and the householders come to see my hardships, and may it be for those in the Śrāvakayāna as previously described, and so on. “ ‘

source: བུད་མེད་གང་བདག་བལྟ་བའི་སླད་དུ་མཆི་བར་འགྱུར་བ་དེ་ཡང་དེའི་བུད་མེད་ཀྱི་ལུས་ཀྱི་ཐ་མ་ཐོབ་པར་འགྱུར་ཞིང་། གང་དག་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་བར་དུ་ཇི་ལྟར་སྔར་སྨོས་པ་བཞིན་དུ་གྱུར་ཅིག །རི་དགས་དང་།
en: May the women who come to see me have that life be their last as a woman, and may it be for those in the Śrāvakayāna as previously described, and so on.

source: བྱ་གང་དག་གིས་བདག་དཀའ་བ་སྤྱོད་ཅིང་མཆིས་པ་མཐོང་བར་གྱུར་པ་དེ་དག་ཀྱང་དེ་དག་གི་དུད་འགྲོའི་སྐྱེ་གནས་ཀྱི་ལུས་ཀྱི་ཐ་མ་ཐོབ་པར་གྱུར་ཅིག །རི་དགས་དང་བྱ་གང་དག་ཉན་ཐོས་ཀྱི་ཐེག་པ་བར་ས་བོན་བཏབ་པར་གྱུར་པ་དག་ཀྱང་བདག་གིས་འདུལ་བ་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པར་འགྱུར་ཞིང་། གང་དག་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་དག་གི་བར་དུ་ཇི་ལྟར་སྔར་སྨོས་པ་བཞིན་དུ་གྱུར་ཅིག །
en: May the animals and birds that see my hardship have that life be their last as an animal, and may the animals and birds in whom is planted the seed of the Śrāvakayāna become my disciples who are in their last existence; and may it also be for those in the Pratyekabuddhayāna as previously described.

source: ཚུལ་དེ་བཞིན་དུ་དུད་འགྲོའི་སྐྱེ་གནས་ཕྲ་མོ་དག་ལ་ཡང་བརྗོད་པར་བགྱིའོ། །དེ་བཞིན་དུ་ཡི་དགས་རྣམས་ལ་ཡང་བརྗོད་པར་བགྱིའོ།
en: And the same is to be said about the various tiny creatures and about the pretas. “ ‘

source: །ཇི་སྲིད་དུ་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་དག་བདག་དཀའ་བ་སྤྱོད་པའི་དབང་དུ་འགྱུར་ཞིང་ངོ་མཚར་དུ་འཛིན་པར་འགྱུར་བ་དཔག་ཏུ་མ་མཆིས་གྲངས་མ་མཆིས་པ་དེ་དག་གིས་སེམས་ཀྱི་རྒྱུད་ལ་ཐར་པའི་ས་བོན་སྐྱེད་པར་འགྱུར་བའི་ཡུན་རིང་པོ་དེ་སྲིད་དུ་བདག་སྐྱིལ་མོ་ཀྲུང་གཅིག་གིས་དེ་ལྟ་བུའི་དཀའ་བ་སྤྱད་པ་སྤྱོད་པར་གྱུར་ཅིག །
en: During the time in which I practice hardship sitting cross-legged for a long time, may many hundreds of millions of trillions of beings witness my hardship and be astonished, and may I plant countless, numberless seeds of liberation within their minds. “ ‘

source: ཇི་ལྟར་སྔོན་ཆད་སེམས་ཅན་དུ་བགྲང་བ་གཞན་མུ་སྟེགས་ཅན་དང་། ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་དང་། བླ་ན་མེད་པའི་ཐེག་པ་ཆེན་པོ་པ་སུས་ཀྱང་སྔོན་དེ་ལྟ་བུའི་དཀའ་བ་མ་སྤྱད་ལ།
en: May I practice a hardship that has never before been practiced by anyone numbered among beings, whether tīrthikas, those in the Śrāvakayāna, those in the Pratyekabuddhayāna, or those in the highest yāna, the Mahāyāna.

source: སླན་ཆད་ཀྱང་སེམས་ཅན་དུ་བགྲང་བ་དང་། གཞན་མུ་སྟེགས་ཅན་སུ་ཡང་ཇི་ལྟར་བདག་སྤྱོད་པར་འགྱུར་བ་དེ་ལྟ་བུའི་དཀའ་བ་སྤྱད་པ་སྤྱོད་པར་རྔོ་མི་ཐོགས་པ་དེ་ལྟ་བུའི་དཀའ་བ་སྤྱོད་པ་བདག་སྤྱོད་པར་གྱུར་ཅིག །
en: And afterward may there never be anyone numbered among beings and those who are tīrthikas who can equal the hardship I will have practiced. “ ‘

source: བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མ་ཐོབ་པ་དེའི་ཚེ་སྐྱེས་བུའི་རྩལ་བགྱིད་ཅིང་བདུད་དཔུང་གི་ཚོགས་དང་བཅས་པ་ཕམ་པར་བགྱིད་པར་གྱུར་ཅིག །
en: Before I have attained complete enlightenment, with the strength of a human may I defeat Māra and his army.

source: ལས་ཀྱི་འབྲས་བུའི་ལྷག་མ་དང་བཅས་པ་ལ་གནས་པའི་ཉོན་མོངས་པའི་བདུད་ལས་རྒྱལ་ཞིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གྱུར་ཅིག །
en: May I be victorious over the Māra of the kleśas, who is determined by my remaining karmic results, and may I attain the complete enlightenment of perfect buddhahood. “ ‘

source: ཅི་ནས་ཀྱང་བདག་སེམས་ཅན་གཅིག་གི་སེམས་ཀྱི་རྒྱུད་ལ་དགྲ་བཅོམ་པ་ཉིད་འཇོག་པར་འགྱུར་བ་དང་། དེ་བཞིན་དུ་གཉིས་པ་དང་། དེ་བཞིན་དུ་གསུམ་པ་དང་། དེ་བཞིན་དུ་བཞི་པ་ལ་ཡང་ཆོས་སྟོན་པར་འགྱུར་ཞིང་། སེམས་ཀྱི་རྒྱུད་ལ་ཡང་དགྲ་བཅོམ་པ་ཉིད་འཇོག་པར་གྱུར་ཅིག །
en: May I establish arhathood in the mind of one being, and may I do so with a second being and a third, and in the same way teach the Dharma to a fourth being and establish arhathood in his mind. “ ‘

source: སེམས་ཅན་གཅིག་གི་དོན་གྱི་སླད་དུ་ཡང་བདག་ཆོ་འཕྲུལ་འབུམ་ཕྲག་དུ་མ་སྟོན་པར་འགྱུར་ཞིང་དེའི་སེམས་ཀྱི་རྒྱུད་ལ་ཡང་དག་པའི་ལྟ་བ་འཇོག་པར་གྱུར་ཅིག །
en: May I for the sake of just one being manifest many hundreds of thousands of miracles and thereby establish the true view in his mind.

source: ཆོས་ཀྱི་དོན་དང་། ཚིག་འབྲུ་སྟོང་ཕྲག་མང་པོ་དག་ཀྱང་རྗོད་པར་གྱུར་ཅིག །
en: May I utter many thousands of words and meanings of the Dharma.

source: ཇི་ལྟར་རྔོ་ཐོགས་པའི་འབྲས་བུ་ལ་ཡང་འཇོག་པར་གྱུར་ཅིག །
en: May I establish beings in the results that they are capable of.

source: སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཀྱི་རྒྱུད་ཀྱི་ཉོན་མོངས་པའི་རི་བོ་དག་ཡེ་ཤེས་ཀྱི་རྡོ་རྗེས་འཇོམས་པར་གྱུར་ཅིག །
en: May I destroy, with the thunderbolt of wisdom, the mountains of kleśas that are in the minds of beings.

source: ཐེག་པ་རྣམ་གསུམ་རྣམ་པར་དགོད་པས་ཆོས་སྟོན་པར་གྱུར་ཅིག །
en: May I teach them the Dharma by establishing them in the three yānas.

source: སེམས་ཅན་གཅིག་གི་དོན་དུ་ཆོས་སྟོན་ཅིང་མི་འཇིགས་པའི་གོ་འཕང་ལ་རབ་ཏུ་དགོད་པའི་སླད་དུ་ཡང་བདག་དཔག་ཚད་བརྒྱ་ཕྲག་མང་པོ་དག་ཏུ་སུག་པས་མཆི་བར་གྱུར་ཅིག །བདག་གི་བསྟན་པ་ལ་རབ་ཏུ་འབྱུང་བ་དག་དགག་པ་མ་མཆིས་པར་འགྱུར་ཞིང་ཉམ་ཆུང་བ་དང་། དྲན་པ་ཉམས་པ་དང་།
en: May I walk many hundreds of yojanas on foot for the sake of just one being in order to teach him the Dharma and establish him on the level of fearlessness. “ ‘

source: སེམས་རྣམ་པར་འཁྲུལ་པ་དང་།
en: May no one be prevented from taking ordination in my order.

source: མུ་ཅོར་སྨྲ་བ་དང་། སྤྱི་བརྟོལ་ཅན་གྱི་སེམས་དང་། ཤེས་རབ་འཆལ་པའི་སེམས་དང་། ཉོན་མོངས་པ་མང་པོས་དཀྲུགས་པའི་སེམས་དང་ལྡན་པ་རྣམས་དང་། བུད་མེད་ཀྱང་བདག་གིས་བསྟན་པ་ལ་རབ་ཏུ་འབྱུང་བ་ཕུན་སུམ་ཚོགས་པར་གྱུར་ཅིག །
en: May those who have lost their memory, those who have confused minds, the talkative with arrogant minds, those with corrupted minds, those with little intelligence, those whose minds are disturbed by many kleśas, and women receive ordination in my order.

source: བདག་ལ་འཁོར་བཞི་པོ་དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་དག་མཆིས་པར་གྱུར་ཅིག །
en: May my followers be fourfold: bhikṣus, bhikṣuṇīs, upāsakas, and upāsikās.

source: སྐྱེ་བོ་མང་པོ་དག་གིས་བདག་གི་བསྟན་པ་རྒྱས་པར་གྱུར་ཅིག །
en: May there be many beings who spread my teaching.
